GBA使用的ARM7TDMI可寻址 4GB地址空间,
对于GBA来说只使用其中低位28位, 高四位不使用.

(* 00000000-01FFFFFF - BIOS, 总线宽度32位*)
这部分前32K是BIOS程序的放置处, 注意BIOS不可写.
32K往上读将读不到数据.

(* 02000000-02FFFFFF - 256K RAM 总线宽度32位*)
衔接在主板上的256K内存, 他的读写性能要比卡带内存好一点(常规情况下).
读写前256K这部分区域外的地址会被镜像到256K内存内. (addr &= 0x3FFFF)

(* 03000000-03FFFFFF - 32K RAM 总线宽度32位*)
芯片内部的32K内存, 他的读写性能是最好的, 很多时候卡带会把代码拷贝到此内存执行..
读写前32K这部分区域外的地址会被镜像到32K内存内. (addr &= 0x7FFF)

(* 04000000-04FFFFFF - 内存IO 总线宽度32位*)
芯片内部的内存IO空间(前1K空间有数据, 以及少部分IO在2K之内), 
此处只有一个特殊镜像, 以后会说明. 

(* 05000000-05FFFFFF - BG/SP调色板 总线宽度16位*)
前1K为有效数据, 读写之后超出范围的地址会被镜像 (addr &= 0x3FF)
前512字节为BG调色板, 后512字节为SP调色板

(* 06000000-06FFFFFF - GPU显存 总线宽度16位*)
前96K为有效数据, 通常而言前64K给卷轴用, 后32K给精灵用
读写之后超出范围的地址会被镜像, 这部分镜像不是单纯的线性镜像映射 
首先每0x20000镜像一次, 
在这0x20000里面, 前0x17FFF都是镜像0x06000000 ~ 0x06017FFF, 
最后这32K映射镜像灵 0x06010000~0x06017FFF
如图----------------------------------------------------------------------------------------------------------------------
         0x00000 | 0x08000 | 0x10000       |            0x18000            |            0x20000
--------------------------------------------------------------------------------------------------------------------------
0x20000 | 0~0xFFFF      64K Bg卷轴         |  0x10000~0x17FFF 32K精灵      |   0x18000 ~ 0x1FFFF 32K精灵镜像
--------------------------------------------------------------------------------------------------------------------------
0x20000 | 0~0xFFFF      64K Bg卷轴         |  0x10000~0x17FFF 32K精灵      |   0x18000 ~ 0x1FFFF 32K精灵镜像
--------------------------------------------------------------------------------------------------------------------------
0x20000 | 0~0xFFFF      64K Bg卷轴         |  0x10000~0x17FFF 32K精灵      |   0x18000 ~ 0x1FFFF 32K精灵镜像
--------------------------------------------------------------------------------------------------------------------------
0x20000 | 0~0xFFFF      64K Bg卷轴         |  0x10000~0x17FFF 32K精灵      |   0x18000 ~ 0x1FFFF 32K精灵镜像
--------------------------------------------------------------------------------------------------------------------------
0x20000 | 0~0xFFFF      64K Bg卷轴         |  0x10000~0x17FFF 32K精灵      |   0x18000 ~ 0x1FFFF 32K精灵镜像
--------------------------------------------------------------------------------------------------------------------------

(* 07000000-07FFFFFF - 精灵属性内存 总线宽度32位*)
前1K为有效数据, 读写之后超出范围的地址会被镜像 (addr &= 0x3FF)

(* 08000000-09FFFFFF - GBA卡带内存 总线宽度16位 - Wait State 0*)
(* 0A000000-0BFFFFFF - GBA卡带内存 总线宽度16位 - Wait State 1*)
(* 0C000000-0DFFFFFF - GBA卡带内存 总线宽度16位 - Wait State 2*)
这三部分的32MB内存读写的都是一样的数据, 常规状态不可写, 对于Flash卡带是可写的
其中区别在于后面的Wait State, 
每部分区域的WaitState状态都可以被设置, (其中最主要的用途是用来访问慢速设备).....

(* 0E000000-0FFFFFFF 电池, 总线宽度为8位 *)
前64K有效, 读写之后的做镜像, 卡带的SRAM, 主要用来保存数据/存档
